# Impyte Documentation
This is a first practicle attempt to clarify the usage of `impyte`. It's a collection of easy applicable and reproducible examples that you could use to simplyify your data processing workflow.

## Importing and generating sample data
In order to show some of the features of the library, we'll be using Kaggle's HR data that can be found [here](https://www.kaggle.com/ludobenistant/hr-analytics).

In [230]:
# import library and data set
import impyte
import pandas as pd
from tools.data_prep import remove_random

In [231]:
data = pd.read_csv('data/hr_test.csv')

In [232]:
data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

## Add random missing values
In order to show some of the pattern visualization and imputation methods, we need incomplete data sets. To achieve this, we'll be using a helper function that deletes values at random. 25 % of all values from each category will be deleted.

In [233]:
data = remove_random(data, .25, randomize_index=False)

In [234]:
data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,NaN,0.56,2.0,129.0,3.0,0.0,1.0,0.0,sales,low
1,NaN,1.00,4.0,185.0,2.0,1.0,0.0,0.0,sales,low
2,NaN,0.63,3.0,257.0,3.0,0.0,0.0,0.0,sales,low
3,NaN,0.66,3.0,154.0,2.0,0.0,0.0,0.0,hr,medium
4,NaN,0.91,3.0,202.0,2.0,0.0,0.0,0.0,sales,medium

In [235]:
data.describe()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years
count,14625.000000,14625.000000,14625.000000,14625.000000,14625.000000,14625.000000,14625.000000,14625.000000
mean,0.612859,0.716343,3.798769,201.047043,3.493675,0.144684,0.237812,0.021402
std,0.248559,0.171282,1.230504,49.927042,1.455806,0.351794,0.425758,0.144724
min,0.090000,0.360000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000
25%,0.440000,0.560000,3.000000,156.000000,3.000000,0.000000,0.000000,0.000000
50%,0.640000,0.720000,4.000000,200.000000,3.000000,0.000000,0.000000,0.000000
75%,0.820000,0.870000,5.000000,245.000000,4.000000,0.000000,0.000000,0.000000
max,1.000000,1.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000

In [236]:
len(data)

14999

In [237]:
reload(impyte)

## Testing rudimentary features
Below is a first trial run of some of the features implemented by impyter and its helper classes.

## `NanChecker`
Functionality testing of `NanChecker` class.

In [238]:
nan_checker = impyte.NanChecker()

#### `NanChecker.is_nan(data, nan_vals=None, recursive=True)`
Detect missing values (NaN in numeric arrays, empty strings in string arrays). NaN detection feature also enables NaN-value ingestion as parameter values.

In [239]:
# [True, False, False]
print nan_checker.is_nan(["", 'None', 'NaN'])

# [True, True, True]
print nan_checker.is_nan(["", 'None', 'NaN'], nan_vals=['', None, 'None', 'NaN'])

[True, False, False]
[True, True, True]

In [240]:
# Recursive nan detection
# [True, True, False, [False, True, True]]
print nan_checker.is_nan(["", None, 'NaN', ["List Value 1", '', None]])

[True, True, False, [False, True, True]]

In [241]:
# Values can be declared as nan-values
# [True, False, False, True]
nan_checker.is_nan(['NaN', 'Empty', 'None', 'N/A'], nan_vals=['NaN', 'N/A'])

[True, False, False, True]

## `Pattern`
Functionality testing of `Pattern` class. The `Pattern` class stores different patterns and data summaries regarding NaN values.

#### `Pattern._get_discrete_and_continuous(tmpdata)`
Returns the column names of discrete and continuous variables. Column names are stored in lists for easy selection. Those lists are stored in one dictionary object. All continuous column names can be accessed through `['continuous']` all discrete variables through `['discrete']`.

In [242]:
reload(impyte)
pattern_log = impyte.Pattern()

In [243]:
pattern_log._get_discrete_and_continuous(data)

{'continuous': ['satisfaction_level',
  'last_evaluation',
  'number_project',
  'average_montly_hours',
  'time_spend_company',
  'Work_accident',
  'left',
  'promotion_last_5years'],
 'discrete': ['sales', 'salary']}

#### `Pattern._compute_pattern(data, nan_values="", verbose=False)`
Function that checks for missing values and prints out a quick table of a summary of missing values. Includes pattern overview and counts of missing values by column. Computes pattern and returns its pattern structure plus the count of data points for each of these patterns. To get a nice digestible table add `["table"]` selector to output.

In [244]:
pattern_dict = pattern_log._compute_pattern(data)
indices, table = pattern_dict["indices"], pattern_dict["table"]

In [245]:
table

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary,Count
0,1,1,1,1,1,1,1,1,1,1,11259
1,1,1,1,1,1,1,1,1,NaN,1,374
2,1,1,1,NaN,1,1,1,1,1,1,374
3,1,1,NaN,1,1,1,1,1,1,1,374
4,1,1,1,1,1,1,1,1,1,NaN,374
5,1,1,1,1,1,1,1,NaN,1,1,374
6,1,1,1,1,NaN,1,1,1,1,1,374
7,NaN,1,1,1,1,1,1,1,1,1,374
8,1,NaN,1,1,1,1,1,1,1,1,374
9,1,1,1,1,1,NaN,1,1,1,1,374
10,1,1,1,1,1,1,NaN,1,1,1,374

In [246]:
indices[0][:10] # first 10 indices of pattern 0

[3740, 3741, 3742, 3743, 3744, 3745, 3746, 3747, 3748, 3749]

In [247]:
pattern_nr = 0
print "Pattern {} has {:,} rows.".format(pattern_nr, len(indices[0]))

Pattern 0 has 11,259 rows.

#### `Pattern.get_pattern()`
Returns NaN-patterns based on primary computation or initiates new computation of NaN-patterns. Uses `_compute_patterns()` to visualize patterns if not yet computed. Otherwise returns stored information regarding patterns.

In [248]:
pattern_log.get_pattern()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary,Count
0,1,1,1,1,1,1,1,1,1,1,11259
1,1,1,1,1,1,1,1,1,NaN,1,374
2,1,1,1,NaN,1,1,1,1,1,1,374
3,1,1,NaN,1,1,1,1,1,1,1,374
4,1,1,1,1,1,1,1,1,1,NaN,374
5,1,1,1,1,1,1,1,NaN,1,1,374
6,1,1,1,1,NaN,1,1,1,1,1,374
7,NaN,1,1,1,1,1,1,1,1,1,374
8,1,NaN,1,1,1,1,1,1,1,1,374
9,1,1,1,1,1,NaN,1,1,1,1,374
10,1,1,1,1,1,1,NaN,1,1,1,374

#### `Pattern.row_nan_pattern(row)`
This is a core piece to determining which patterns are available. Other methods work with the output of `row_nan_pattern()` to determine unique pattern structures and count these before turning them into readable tables.

In [249]:
# (1, 1, 'NaN', 'NaN')
print pattern_log.row_nan_pattern(['Value 1', 'Value 2', '', None])

(1, 1, 'NaN', 'NaN')

#### `Pattern.get_pattern_indices(pattern_no)`

In [250]:
pattern_log.get_pattern_indices(0)[:10] # get first 10 indices of pattern 0

[3740, 3741, 3742, 3743, 3744, 3745, 3746, 3747, 3748, 3749]

#### `Pattern.get_continuous()`
Returns list with names of all continuous variables.

In [251]:
pattern_log.get_continuous()

['satisfaction_level',
 'last_evaluation',
 'number_project',
 'average_montly_hours',
 'time_spend_company',
 'Work_accident',
 'left',
 'promotion_last_5years']

#### `Pattern.get_discrete()`
Returns list with names of all discrete variables.

In [252]:
pattern_log.get_discrete()

['sales', 'salary']

## `Impyter`

In [266]:
reload(impyte)
imputer = impyte.Impyter() # instantiate impyte class

### Load data into imputer

In [267]:
_ = imputer.load_data(data)

In [268]:
%timeit imputer.pattern()

The slowest run took 179921.96 times longer than the fastest. This could mean that an intermediate result is being cached.
1 loop, best of 3: 6.2 µs per loop

In [269]:
%timeit imputer.get_pattern(4)

1000 loops, best of 3: 892 µs per loop

In [270]:
reload(impyte)
imputer = impyte.Impyter(data) # instantiate impyte class
nan_checker = impyte.NanChecker()
pattern_log = impyte.Pattern()
imputer.pattern()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary,Count
0,1,1,1,1,1,1,1,1,1,1,11259
1,1,1,1,1,1,1,1,1,NaN,1,374
2,1,1,1,NaN,1,1,1,1,1,1,374
3,1,1,NaN,1,1,1,1,1,1,1,374
4,1,1,1,1,1,1,1,1,1,NaN,374
5,1,1,1,1,1,1,1,NaN,1,1,374
6,1,1,1,1,NaN,1,1,1,1,1,374
7,NaN,1,1,1,1,1,1,1,1,1,374
8,1,NaN,1,1,1,1,1,1,1,1,374
9,1,1,1,1,1,NaN,1,1,1,1,374
10,1,1,1,1,1,1,NaN,1,1,1,374

In [271]:
_ = imputer.drop_pattern(4, inplace=True)

In [272]:
imputer.pattern()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary,Count
0,1,1,1,1,1,1,1,1,1,1,11259
1,1,1,1,1,1,1,1,1,NaN,1,374
2,1,1,1,NaN,1,1,1,1,1,1,374
3,1,1,NaN,1,1,1,1,1,1,1,374
5,1,1,1,1,1,1,1,NaN,1,1,374
6,1,1,1,1,NaN,1,1,1,1,1,374
7,NaN,1,1,1,1,1,1,1,1,1,374
8,1,NaN,1,1,1,1,1,1,1,1,374
9,1,1,1,1,1,NaN,1,1,1,1,374
10,1,1,1,1,1,1,NaN,1,1,1,374

In [273]:
_ = imputer.load_data(data)

In [274]:
imputer.pattern()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary,Count
0,1,1,1,1,1,1,1,1,1,1,11259
1,1,1,1,1,1,1,1,1,NaN,1,374
2,1,1,1,NaN,1,1,1,1,1,1,374
3,1,1,NaN,1,1,1,1,1,1,1,374
4,1,1,1,1,1,1,1,1,1,NaN,374
5,1,1,1,1,1,1,1,NaN,1,1,374
6,1,1,1,1,NaN,1,1,1,1,1,374
7,NaN,1,1,1,1,1,1,1,1,1,374
8,1,NaN,1,1,1,1,1,1,1,1,374
9,1,1,1,1,1,NaN,1,1,1,1,374
10,1,1,1,1,1,1,NaN,1,1,1,374

In [275]:
_ = imputer.drop_pattern(4)

In [276]:
imputer.pattern()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary,Count
0,1,1,1,1,1,1,1,1,1,1,11259
1,1,1,1,1,1,1,1,1,NaN,1,374
2,1,1,1,NaN,1,1,1,1,1,1,374
3,1,1,NaN,1,1,1,1,1,1,1,374
4,1,1,1,1,1,1,1,1,1,NaN,374
5,1,1,1,1,1,1,1,NaN,1,1,374
6,1,1,1,1,NaN,1,1,1,1,1,374
7,NaN,1,1,1,1,1,1,1,1,1,374
8,1,NaN,1,1,1,1,1,1,1,1,374
9,1,1,1,1,1,NaN,1,1,1,1,374
10,1,1,1,1,1,1,NaN,1,1,1,374

In [277]:
for a in imputer.pattern_log.easy_access:
    print imputer.pattern_log.easy_access[a]

['sales']
['average_montly_hours']
['number_project']
['salary']
['promotion_last_5years']
['time_spend_company']
['satisfaction_level']
['last_evaluation']
['Work_accident']
['left']

In [278]:
imputer.pattern_log.easy_access

{(1, 1, 1, 1, 1, 1, 1, 1, 1, 'NaN'): ['salary'],
 (1, 1, 1, 1, 1, 1, 1, 1, 'NaN', 1): ['sales'],
 (1, 1, 1, 1, 1, 1, 1, 'NaN', 1, 1): ['promotion_last_5years'],
 (1, 1, 1, 1, 1, 1, 'NaN', 1, 1, 1): ['left'],
 (1, 1, 1, 1, 1, 'NaN', 1, 1, 1, 1): ['Work_accident'],
 (1, 1, 1, 1, 'NaN', 1, 1, 1, 1, 1): ['time_spend_company'],
 (1, 1, 1, 'NaN', 1, 1, 1, 1, 1, 1): ['average_montly_hours'],
 (1, 1, 'NaN', 1, 1, 1, 1, 1, 1, 1): ['number_project'],
 (1, 'NaN', 1, 1, 1, 1, 1, 1, 1, 1): ['last_evaluation'],
 ('NaN', 1, 1, 1, 1, 1, 1, 1, 1, 1): ['satisfaction_level']}

In [279]:
for a in imputer.pattern_log.easy_access:
    print a

(1, 1, 1, 1, 1, 1, 1, 1, 'NaN', 1)
(1, 1, 1, 'NaN', 1, 1, 1, 1, 1, 1)
(1, 1, 'NaN', 1, 1, 1, 1, 1, 1, 1)
(1, 1, 1, 1, 1, 1, 1, 1, 1, 'NaN')
(1, 1, 1, 1, 1, 1, 1, 'NaN', 1, 1)
(1, 1, 1, 1, 'NaN', 1, 1, 1, 1, 1)
('NaN', 1, 1, 1, 1, 1, 1, 1, 1, 1)
(1, 'NaN', 1, 1, 1, 1, 1, 1, 1, 1)
(1, 1, 1, 1, 1, 'NaN', 1, 1, 1, 1)
(1, 1, 1, 1, 1, 1, 'NaN', 1, 1, 1)

In [282]:
imputer.pattern_log.store_tuple_columns

{(1, 1, 1, 1, 1, 1, 1, 1, 1, 1): [],
 (1, 1, 1, 1, 1, 1, 1, 1, 1, 'NaN'): [9],
 (1, 1, 1, 1, 1, 1, 1, 1, 'NaN', 1): [8],
 (1, 1, 1, 1, 1, 1, 1, 'NaN', 1, 1): [7],
 (1, 1, 1, 1, 1, 1, 'NaN', 1, 1, 1): [6],
 (1, 1, 1, 1, 1, 'NaN', 1, 1, 1, 1): [5],
 (1, 1, 1, 1, 'NaN', 1, 1, 1, 1, 1): [4],
 (1, 1, 1, 'NaN', 1, 1, 1, 1, 1, 1): [3],
 (1, 1, 'NaN', 1, 1, 1, 1, 1, 1, 1): [2],
 (1, 'NaN', 1, 1, 1, 1, 1, 1, 1, 1): [1],
 ('NaN', 1, 1, 1, 1, 1, 1, 1, 1, 1): [0]}

### Comparison of complete indices methods

In [217]:
%timeit len(imputer.pattern_log.get_complete_indices())

100 loops, best of 3: 4.75 ms per loop

In [218]:
%timeit len(imputer.get_complete_old())

100 loops, best of 3: 5.61 ms per loop

In [219]:
_ = imputer.drop_pattern(7, inplace=True)

In [220]:
imputer.pattern_log.store_tuple_columns

{(1, 1, 1, 1, 1, 1, 1, 1, 1, 1): [],
 (1, 1, 1, 1, 1, 1, 1, 1, 1, 'NaN'): [9],
 (1, 1, 1, 1, 1, 1, 1, 1, 'NaN', 1): [8],
 (1, 1, 1, 1, 1, 1, 1, 1, 'NaN', 'NaN'): [8, 9],
 (1, 1, 1, 1, 1, 1, 1, 'NaN', 1, 1): [7],
 (1, 1, 1, 1, 1, 1, 1, 'NaN', 1, 'NaN'): [7, 9],
 (1, 1, 1, 1, 1, 1, 1, 'NaN', 'NaN', 1): [7, 8],
 (1, 1, 1, 1, 1, 1, 'NaN', 1, 1, 1): [6],
 (1, 1, 1, 1, 1, 1, 'NaN', 1, 1, 'NaN'): [6, 9],
 (1, 1, 1, 1, 1, 1, 'NaN', 1, 'NaN', 1): [6, 8],
 (1, 1, 1, 1, 1, 1, 'NaN', 1, 'NaN', 'NaN'): [6, 8, 9],
 (1, 1, 1, 1, 1, 1, 'NaN', 'NaN', 1, 1): [6, 7],
 (1, 1, 1, 1, 1, 1, 'NaN', 'NaN', 1, 'NaN'): [6, 7, 9],
 (1, 1, 1, 1, 1, 1, 'NaN', 'NaN', 'NaN', 1): [6, 7, 8],
 (1, 1, 1, 1, 1, 'NaN', 1, 1, 1, 1): [5],
 (1, 1, 1, 1, 1, 'NaN', 1, 1, 1, 'NaN'): [5, 9],
 (1, 1, 1, 1, 1, 'NaN', 1, 1, 'NaN', 1): [5, 8],
 (1, 1, 1, 1, 1, 'NaN', 1, 1, 'NaN', 'NaN'): [5, 8, 9],
 (1, 1, 1, 1, 1, 'NaN', 1, 'NaN', 1, 1): [5, 7],
 (1, 1, 1, 1, 1, 'NaN', 1, 'NaN', 1, 'NaN'): [5, 7, 9],
 (1, 1, 1, 1, 1, 'NaN', 1, 'NaN', 'NaN', 1): [5, 7, 8],
 (1, 1, 1, 1, 1, 'NaN', 'NaN', 1, 1, 1): [5, 6],
 (1, 1, 1, 1, 1, 'NaN', 'NaN', 1, 1, 'NaN'): [5, 6, 9],
 (1, 1, 1, 1, 1, 'NaN', 'NaN', 'NaN', 1, 1): [5, 6, 7],
 (1, 1, 1, 1, 'NaN', 1, 1, 1, 1, 1): [4],
 (1, 1, 1, 1, 'NaN', 1, 1, 1, 1, 'NaN'): [4, 9],
 (1, 1, 1, 1, 'NaN', 1, 1, 1, 'NaN', 1): [4, 8],
 (1, 1, 1, 1, 'NaN', 1, 1, 1, 'NaN', 'NaN'): [4, 8, 9],
 (1, 1, 1, 1, 'NaN', 1, 1, 'NaN', 1, 1): [4, 7],
 (1, 1, 1, 1, 'NaN', 1, 1, 'NaN', 1, 'NaN'): [4, 7, 9],
 (1, 1, 1, 1, 'NaN', 1, 'NaN', 1, 1, 1): [4, 6],
 (1, 1, 1, 1, 'NaN', 1, 'NaN', 1, 1, 'NaN'): [4, 6, 9],
 (1, 1, 1, 1, 'NaN', 1, 'NaN', 1, 'NaN', 1): [4, 6, 8],
 (1, 1, 1, 1, 'NaN', 1, 'NaN', 'NaN', 1, 1): [4, 6, 7],
 (1, 1, 1, 1, 'NaN', 'NaN', 1, 1, 1, 1): [4, 5],
 (1, 1, 1, 1, 'NaN', 'NaN', 1, 1, 'NaN', 1): [4, 5, 8],
 (1, 1, 1, 1, 'NaN', 'NaN', 1, 'NaN', 1, 1): [4, 5, 7],
 (1, 1, 1, 1, 'NaN', 'NaN', 'NaN', 1, 1, 1): [4, 5, 6],
 (1, 1, 1, 'NaN', 1, 1, 1, 1, 1, 1): [3],
 (1, 1, 1, 'NaN', 1, 1, 1, 1, 1, 'NaN'): [3, 9],
 (1, 1, 1, 'NaN', 1, 1, 1, 1, 'NaN', 1): [3, 8],
 (1, 1, 1, 'NaN', 1, 1, 1, 1, 'NaN', 'NaN'): [3, 8, 9],
 (1, 1, 1, 'NaN', 1, 1, 1, 'NaN', 1, 1): [3, 7],
 (1, 1, 1, 'NaN', 1, 1, 1, 'NaN', 1, 'NaN'): [3, 7, 9],
 (1, 1, 1, 'NaN', 1, 1, 1, 'NaN', 'NaN', 1): [3, 7, 8],
 (1, 1, 1, 'NaN', 1, 1, 'NaN', 1, 1, 1): [3, 6],
 (1, 1, 1, 'NaN', 1, 1, 'NaN', 1, 1, 'NaN'): [3, 6, 9],
 (1, 1, 1, 'NaN', 1, 1, 'NaN', 1, 'NaN', 1): [3, 6, 8],
 (1, 1, 1, 'NaN', 1, 'NaN', 1, 1, 1, 1): [3, 5],
 (1, 1, 1, 'NaN', 1, 'NaN', 1, 1, 1, 'NaN'): [3, 5, 9],
 (1, 1, 1, 'NaN', 1, 'NaN', 1, 1, 'NaN', 1): [3, 5, 8],
 (1, 1, 1, 'NaN', 1, 'NaN', 1, 'NaN', 1, 1): [3, 5, 7],
 (1, 1, 1, 'NaN', 1, 'NaN', 'NaN', 1, 1, 1): [3, 5, 6],
 (1, 1, 1, 'NaN', 'NaN', 1, 1, 1, 1, 1): [3, 4],
 (1, 1, 1, 'NaN', 'NaN', 1, 1, 1, 1, 'NaN'): [3, 4, 9],
 (1, 1, 1, 'NaN', 'NaN', 1, 1, 'NaN', 1, 1): [3, 4, 7],
 (1, 1, 1, 'NaN', 'NaN', 'NaN', 1, 1, 1, 1): [3, 4, 5],
 (1, 1, 'NaN', 1, 1, 1, 1, 1, 1, 1): [2],
 (1, 1, 'NaN', 1, 1, 1, 1, 1, 1, 'NaN'): [2, 9],
 (1, 1, 'NaN', 1, 1, 1, 1, 1, 'NaN', 1): [2, 8],
 (1, 1, 'NaN', 1, 1, 1, 1, 1, 'NaN', 'NaN'): [2, 8, 9],
 (1, 1, 'NaN', 1, 1, 1, 1, 'NaN', 1, 1): [2, 7],
 (1, 1, 'NaN', 1, 1, 1, 1, 'NaN', 1, 'NaN'): [2, 7, 9],
 (1, 1, 'NaN', 1, 1, 1, 1, 'NaN', 'NaN', 1): [2, 7, 8],
 (1, 1, 'NaN', 1, 1, 1, 'NaN', 1, 1, 1): [2, 6],
 (1, 1, 'NaN', 1, 1, 1, 'NaN', 1, 'NaN', 1): [2, 6, 8],
 (1, 1, 'NaN', 1, 1, 'NaN', 1, 1, 1, 1): [2, 5],
 (1, 1, 'NaN', 1, 1, 'NaN', 1, 1, 1, 'NaN'): [2, 5, 9],
 (1, 1, 'NaN', 1, 1, 'NaN', 1, 1, 'NaN', 1): [2, 5, 8],
 (1, 1, 'NaN', 1, 1, 'NaN', 1, 'NaN', 1, 1): [2, 5, 7],
 (1, 1, 'NaN', 1, 'NaN', 1, 1, 1, 1, 1): [2, 4],
 (1, 1, 'NaN', 1, 'NaN', 1, 1, 1, 1, 'NaN'): [2, 4, 9],
 (1, 1, 'NaN', 1, 'NaN', 1, 1, 'NaN', 1, 1): [2, 4, 7],
 (1, 1, 'NaN', 1, 'NaN', 1, 'NaN', 1, 1, 1): [2, 4, 6],
 (1, 1, 'NaN', 1, 'NaN', 'NaN', 1, 1, 1, 1): [2, 4, 5],
 (1, 1, 'NaN', 'NaN', 1, 1, 1, 1, 1, 1): [2, 3],
 (1, 1, 'NaN', 'NaN', 1, 1, 1, 1, 1, 'NaN'): [2, 3, 9],
 (1, 1, 'NaN', 'NaN', 1, 1, 'NaN', 1, 1, 1): [2, 3, 6],
 (1, 1, 'NaN', 'NaN', 1, 'NaN', 1, 1, 1, 1): [2, 3, 5],
 (1, 1, 'NaN', 'NaN', 'NaN', 1, 1, 1, 1, 1): [2, 3, 4],
 (1, 'NaN', 1, 1, 1, 1, 1, 1, 1, 1): [1],
 (1, 'NaN', 1, 1, 1, 1, 1, 1, 1, 'NaN'): [1, 9],
 (1, 'NaN', 1, 1, 1, 1, 1, 1, 'NaN', 1): [1, 8],
 (1, 'NaN', 1, 1, 1, 1, 1, 1, 'NaN', 'NaN'): [1, 8, 9],
 (1, 'NaN', 1, 1, 1, 1, 1, 'NaN', 1, 1): [1, 7],
 (1, 'NaN', 1, 1, 1, 1, 1, 'NaN', 1, 'NaN'): [1, 7, 9],
 (1, 'NaN', 1, 1, 1, 1, 'NaN', 1, 1, 1): [1, 6],
 (1, 'NaN', 1, 1, 1, 1, 'NaN', 1, 1, 'NaN'): [1, 6, 9],
 (1, 'NaN', 1, 1, 1, 1, 'NaN', 'NaN', 1, 1): [1, 6, 7],
 (1, 'NaN', 1, 1, 1, 'NaN', 1, 1, 1, 1): [1, 5],
 (1, 'NaN', 1, 1, 1, 'NaN', 1, 1, 1, 'NaN'): [1, 5, 9],
 (1, 'NaN', 1, 1, 1, 'NaN', 1, 'NaN', 1, 1): [1, 5, 7],
 (1, 'NaN', 1, 1, 'NaN', 1, 1, 1, 1, 1): [1, 4],
 (1, 'NaN', 1, 1, 'NaN', 1, 1, 'NaN', 1, 1): [1, 4, 7],
 (1, 'NaN', 1, 1, 'NaN', 1, 'NaN', 1, 1, 1): [1, 4, 6],
 (1, 'NaN', 1, 1, 'NaN', 'NaN', 1, 1, 1, 1): [1, 4, 5],
 (1, 'NaN', 1, 'NaN', 1, 1, 1, 1, 1, 1): [1, 3],
 (1, 'NaN', 1, 'NaN', 1, 1, 1, 1, 'NaN', 1): [1, 3, 8],
 (1, 'NaN', 1, 'NaN', 1, 1, 1, 'NaN', 1, 1): [1, 3, 7],
 (1, 'NaN', 1, 'NaN', 1, 1, 'NaN', 1, 1, 1): [1, 3, 6],
 (1, 'NaN', 1, 'NaN', 'NaN', 1, 1, 1, 1, 1): [1, 3, 4],
 (1, 'NaN', 'NaN', 1, 1, 1, 1, 1, 1, 1): [1, 2],
 (1, 'NaN', 'NaN', 1, 1, 1, 1, 1, 1, 'NaN'): [1, 2, 9],
 (1, 'NaN', 'NaN', 1, 1, 1, 1, 1, 'NaN', 1): [1, 2, 8],
 (1, 'NaN', 'NaN', 1, 1, 1, 1, 'NaN', 1, 1): [1, 2, 7],
 (1, 'NaN', 'NaN', 'NaN', 1, 1, 1, 1, 1, 1): [1, 2, 3],
 ('NaN', 1, 1, 1, 1, 1, 1, 1, 1, 1): [0],
 ('NaN', 1, 1, 1, 1, 1, 1, 1, 1, 'NaN'): [0, 9],
 ('NaN', 1, 1, 1, 1, 1, 1, 1, 'NaN', 1): [0, 8],
 ('NaN', 1, 1, 1, 1, 1, 1, 'NaN', 1, 1): [0, 7],
 ('NaN', 1, 1, 1, 1, 1, 1, 'NaN', 1, 'NaN'): [0, 7, 9],
 ('NaN', 1, 1, 1, 1, 1, 1, 'NaN', 'NaN', 1): [0, 7, 8],
 ('NaN', 1, 1, 1, 1, 1, 'NaN', 1, 1, 1): [0, 6],
 ('NaN', 1, 1, 1, 1, 1, 'NaN', 1, 1, 'NaN'): [0, 6, 9],
 ('NaN', 1, 1, 1, 1, 1, 'NaN', 1, 'NaN', 1): [0, 6, 8],
 ('NaN', 1, 1, 1, 1, 'NaN', 1, 1, 1, 1): [0, 5],
 ('NaN', 1, 1, 1, 1, 'NaN', 1, 1, 'NaN', 1): [0, 5, 8],
 ('NaN', 1, 1, 1, 1, 'NaN', 1, 'NaN', 1, 1): [0, 5, 7],
 ('NaN', 1, 1, 1, 1, 'NaN', 'NaN', 1, 1, 1): [0, 5, 6],
 ('NaN', 1, 1, 1, 'NaN', 1, 1, 1, 1, 1): [0, 4],
 ('NaN', 1, 1, 1, 'NaN', 1, 1, 1, 1, 'NaN'): [0, 4, 9],
 ('NaN', 1, 1, 1, 'NaN', 1, 1, 1, 'NaN', 1): [0, 4, 8],
 ('NaN', 1, 1, 1, 'NaN', 1, 1, 'NaN', 1, 1): [0, 4, 7],
 ('NaN', 1, 1, 1, 'NaN', 1, 'NaN', 1, 1, 1): [0, 4, 6],
 ('NaN', 1, 1, 1, 'NaN', 'NaN', 1, 1, 1, 1): [0, 4, 5],
 ('NaN', 1, 1, 'NaN', 1, 1, 1, 1, 1, 1): [0, 3],
 ('NaN', 1, 1, 'NaN', 1, 1, 1, 1, 1, 'NaN'): [0, 3, 9],
 ('NaN', 1, 1, 'NaN', 1, 1, 1, 'NaN', 1, 1): [0, 3, 7],
 ('NaN', 1, 1, 'NaN', 1, 1, 'NaN', 1, 1, 1): [0, 3, 6],
 ('NaN', 1, 1, 'NaN', 'NaN', 1, 1, 1, 1, 1): [0, 3, 4],
 ('NaN', 1, 'NaN', 1, 1, 1, 1, 1, 1, 1): [0, 2],
 ('NaN', 1, 'NaN', 1, 1, 1, 1, 1, 1, 'NaN'): [0, 2, 9],
 ('NaN', 1, 'NaN', 1, 1, 1, 1, 1, 'NaN', 1): [0, 2, 8],
 ('NaN', 1, 'NaN', 1, 1, 1, 'NaN', 1, 1, 1): [0, 2, 6],
 ('NaN', 1, 'NaN', 1, 1, 'NaN', 1, 1, 1, 1): [0, 2, 5],
 ('NaN', 1, 'NaN', 1, 'NaN', 1, 1, 1, 1, 1): [0, 2, 4],
 ('NaN', 1, 'NaN', 'NaN', 1, 1, 1, 1, 1, 1): [0, 2, 3],
 ('NaN', 'NaN', 1, 1, 1, 1, 1, 1, 1, 1): [0, 1],
 ('NaN', 'NaN', 1, 1, 1, 1, 1, 1, 1, 'NaN'): [0, 1, 9],
 ('NaN', 'NaN', 1, 1, 1, 1, 1, 1, 'NaN', 1): [0, 1, 8],
 ('NaN', 'NaN', 1, 1, 1, 1, 1, 'NaN', 1, 1): [0, 1, 7],
 ('NaN', 'NaN', 1, 1, 1, 1, 'NaN', 1, 1, 1): [0, 1, 6],
 ('NaN', 'NaN', 1, 1, 1, 'NaN', 1, 1, 1, 1): [0, 1, 5]}

In [221]:
data.iloc[:, imputer.pattern_log.store_tuple_columns[(1, 1, 1, 1, 1, 1, 1, 1, 1, 'NaN')]].columns

Index([u'salary'], dtype='object')

In [222]:
data.tail()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
14994,0.49,0.89,4.0,240.0,2.0,0.0,0.0,0.0,RandD,medium
14995,0.65,0.70,4.0,211.0,2.0,0.0,0.0,0.0,support,low
14996,0.99,0.72,3.0,163.0,3.0,0.0,0.0,0.0,sales,medium
14997,0.62,0.92,5.0,149.0,3.0,0.0,0.0,0.0,IT,low
14998,0.53,0.64,2.0,177.0,4.0,0.0,NaN,0.0,sales,low

### Timing some of the functions
Below is a piece of information on efficiency of the functions. This doesn't reflect complexity of the functions, but it will show an runtime estimate for your local machine.

In [223]:
%timeit nan_checker.is_nan(["", 'None', 'NaN'])
%timeit nan_checker.is_nan(["", 'None', 'NaN'], nan_vals=['', None, 'None', 'NaN'])

100000 loops, best of 3: 5.14 µs per loop
100000 loops, best of 3: 5.11 µs per loop

In [224]:
imputer.pattern_log.get_pattern().index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   8,   9,  10,
            ...
            133, 134, 135, 136, 137, 138, 139, 140, 141, 142],
           dtype='int64', length=142)

In [335]:
reload(impyte)
imputer = impyte.Impyter()
imputer.load_data(data)
_ = imputer.pattern()
imputer.impute()

Using columns ['satisfaction_level' 'last_evaluation' 'number_project'
 'average_montly_hours' 'time_spend_company' 'Work_accident' 'left'
 'promotion_last_5years' 'salary'] to predict ['sales']
Using columns ['satisfaction_level' 'last_evaluation' 'number_project'
 'time_spend_company' 'Work_accident' 'left' 'promotion_last_5years'
 'sales' 'salary'] to predict ['average_montly_hours']
Using columns ['satisfaction_level' 'last_evaluation' 'average_montly_hours'
 'time_spend_company' 'Work_accident' 'left' 'promotion_last_5years'
 'sales' 'salary'] to predict ['number_project']
Using columns ['satisfaction_level' 'last_evaluation' 'number_project'
 'average_montly_hours' 'time_spend_company' 'Work_accident' 'left'
 'promotion_last_5years' 'sales'] to predict ['salary']
Using columns ['satisfaction_level' 'last_evaluation' 'number_project'
 'average_montly_hours' 'time_spend_company' 'Work_accident' 'left' 'sales'
 'salary'] to predict ['promotion_last_5years']
Using columns ['satisfaction_level' 'last_evaluation' 'number_project'
 'average_montly_hours' 'Work_accident' 'left' 'promotion_last_5years'
 'sales' 'salary'] to predict ['time_spend_company']
Using columns ['last_evaluation' 'number_project' 'average_montly_hours'
 'time_spend_company' 'Work_accident' 'left' 'promotion_last_5years'
 'sales' 'salary'] to predict ['satisfaction_level']
Using columns ['satisfaction_level' 'number_project' 'average_montly_hours'
 'time_spend_company' 'Work_accident' 'left' 'promotion_last_5years'
 'sales' 'salary'] to predict ['last_evaluation']
Using columns ['satisfaction_level' 'last_evaluation' 'number_project'
 'average_montly_hours' 'time_spend_company' 'left' 'promotion_last_5years'
 'sales' 'salary'] to predict ['Work_accident']
Using columns ['satisfaction_level' 'last_evaluation' 'number_project'
 'average_montly_hours' 'time_spend_company' 'Work_accident'
 'promotion_last_5years' 'sales' 'salary'] to predict ['left']

(['satisfaction_level',
  'last_evaluation',
  'number_project',
  'average_montly_hours',
  'time_spend_company',
  'Work_accident',
  'left',
  'promotion_last_5years'],
 ['sales', 'salary'])

In [330]:
imputer.pattern_log.easy_access

{(1, 1, 1, 1, 1, 1, 1, 1, 1, 'NaN'): ['salary'],
 (1, 1, 1, 1, 1, 1, 1, 1, 'NaN', 1): ['sales'],
 (1, 1, 1, 1, 1, 1, 1, 'NaN', 1, 1): ['promotion_last_5years'],
 (1, 1, 1, 1, 1, 1, 'NaN', 1, 1, 1): ['left'],
 (1, 1, 1, 1, 1, 'NaN', 1, 1, 1, 1): ['Work_accident'],
 (1, 1, 1, 1, 'NaN', 1, 1, 1, 1, 1): ['time_spend_company'],
 (1, 1, 1, 'NaN', 1, 1, 1, 1, 1, 1): ['average_montly_hours'],
 (1, 1, 'NaN', 1, 1, 1, 1, 1, 1, 1): ['number_project'],
 (1, 'NaN', 1, 1, 1, 1, 1, 1, 1, 1): ['last_evaluation'],
 ('NaN', 1, 1, 1, 1, 1, 1, 1, 1, 1): ['satisfaction_level']}

In [331]:
# get variable name of pattern
imputer.pattern_log.get_column_name(1)

['sales']

In [323]:
imputer.pattern()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary,Count
0,1,1,1,1,1,1,1,1,1,1,11259
1,1,1,1,1,1,1,1,1,NaN,1,374
2,1,1,1,NaN,1,1,1,1,1,1,374
3,1,1,NaN,1,1,1,1,1,1,1,374
4,1,1,1,1,1,1,1,1,1,NaN,374
5,1,1,1,1,1,1,1,NaN,1,1,374
6,1,1,1,1,NaN,1,1,1,1,1,374
7,NaN,1,1,1,1,1,1,1,1,1,374
8,1,NaN,1,1,1,1,1,1,1,1,374
9,1,1,1,1,1,NaN,1,1,1,1,374
10,1,1,1,1,1,1,NaN,1,1,1,374

In [314]:
[tuple(x) for x in imputer.pattern_log.pattern_store_temp["result"].drop('Count', axis=1).values]

[(1, 1, 1, 1, 1, 1, 1, 1, 1, 1),
 (1, 1, 1, 1, 1, 1, 1, 1, 'NaN', 1),
 (1, 1, 1, 'NaN', 1, 1, 1, 1, 1, 1),
 (1, 1, 'NaN', 1, 1, 1, 1, 1, 1, 1),
 (1, 1, 1, 1, 1, 1, 1, 1, 1, 'NaN'),
 (1, 1, 1, 1, 1, 1, 1, 'NaN', 1, 1),
 (1, 1, 1, 1, 'NaN', 1, 1, 1, 1, 1),
 ('NaN', 1, 1, 1, 1, 1, 1, 1, 1, 1),
 (1, 'NaN', 1, 1, 1, 1, 1, 1, 1, 1),
 (1, 1, 1, 1, 1, 'NaN', 1, 1, 1, 1),
 (1, 1, 1, 1, 1, 1, 'NaN', 1, 1, 1)]